# language: ru
Функция: Протечка ночью: включить свет в коридоре

  Сценарий: Правило срабатывает
    Допустим сейчас 22:00
    Когда у «Датчик протечки» «Протечка» становится «протечка»
    Тогда правило «Протечка ночью: включить свет в коридоре» выполнено
    И «Свет в коридоре» получил команду «Свет» = «вкл»

  Сценарий: Устройство без связи
    Допустим сейчас 22:00
    И «Свет в коридоре» без связи
    Когда у «Датчик протечки» «Протечка» становится «протечка»
    Тогда правило «Протечка ночью: включить свет в коридоре» выполнено с ошибкой
    И «Свет в коридоре» не получил команду «Свет»
