# language: ru
Функция: Пожар: открыть шлагбаум и вызвать лифт на 1 этаж
  Правило УК уровня дома: проезд для пожарных и лифт на основном посадочном этаже.

  Сценарий: Правило срабатывает
    Когда у «Пожарный датчик» «Пожар» становится «ЕСТЬ»
    Тогда правило «Пожар: открыть шлагбаум и вызвать лифт на 1 этаж» выполнено
    И «Шлагбаум» получил команду «Открыть» = «1»
    И «Лифт» получил команду «Вызвать (этаж)» = «1»
    И консьерж получает уведомление
    И житель получает уведомление

  Сценарий: Устройство без связи
    Допустим «Шлагбаум» без связи
    Когда у «Пожарный датчик» «Пожар» становится «ЕСТЬ»
    Тогда правило «Пожар: открыть шлагбаум и вызвать лифт на 1 этаж» выполнено с ошибкой
    И «Шлагбаум» не получил команду «Открыть»
    И «Лифт» получил команду «Вызвать (этаж)» = «1»
    И консьерж получает уведомление
    И житель получает уведомление
